# YOLOv10-S with EADNet + SEGFPN + Pruning

# Parameters
nc: 10  # number of classes
scales: # model compound scaling constants
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.75, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLOv10.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 2, EADNet, [128, 15]]  # 2 - EADNet for edge enhancement
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P4/8
  - [-1, 2, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P8/16
  - [-1, 2, C2f, [512, True]]
  - [-1, 1, SEGFPN, [512, 128, 3]]  # 7 - SEGFPN for feature fusion
  - [-1, 1, Conv, [1024, 3, 2]]  # 8-P16/32
  - [-1, 2, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 10
  - [-1, 2, C2f, [1024, False]]  # 11

# YOLOv10.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 7], 1, Concat, [1]]  # cat backbone P4
  - [-1, 2, C2f, [512]]  # 14

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 2, C2f, [256]]  # 17 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]  # cat head P4
  - [-1, 2, C2f, [512]]  # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]  # cat head P5
  - [-1, 2, C2f, [1024]]  # 23 (P8/32-large)

  - [[17, 20, 23], 1, v10Detect, [nc]]  # Detect(P3, P4, P5)
